/*
1-10. 좌표 2개를 입력받은 후 좌표간 거리 계산
좌표 2개를 입력받은 후, 두 좌표간의 거리를 계산해라.

두 좌표 사이의 거리는 ((x값의 차이의 제곱)+(y값의 차이의 제곱))의 제곱근이다.

계산할 때에 sqrt()와 pow()함수를 사용하라.

sqrt()와 pow()함수는 math.h 헤더 파일 안에 있다.프로그램의 맨 위에 다음과 같이 넣어주면 된다.

#include <stdio.h>
#include <math.h>
변수는 다음과 같이 사용하라.

float x1, x2;   // x좌표 값
float y1, y2;   // y좌표 값 
실행 예)

	첫번째 좌표의 x값? 1.0
	첫번째 좌표의 y값? 1.0
	두번째 좌표의 x값? 4.0
	두번째 좌표의 y값? 5.0
	두 좌표 사이의 거리는 5.0
*/
#include <stdio.h>
#include <math.h>

int main(void) {

	float x1, x2;  // x좌표 값
	float y1, y2;  // y좌표 값 
	float distance; // 거리 값
	
	//---------------------------
	
	// "첫번째 좌표의 x값? " 출력
	printf ("첫번째 좌표의 x값? ");
	// x1 입력받기
	scanf("%f", &x1);
	// "첫번째 좌표의 y값? " 출력
	printf ("첫번째 좌표의 y값? ");
	// y1 입력받기
	scanf("%f", &y1);
	// "두번째 좌표의 x값? " 출력
	printf ("두번째 좌표의 x값? ");
	// x2 입력받기
	scanf("%f", &x2);
	// "두번째 좌표의 y값? " 출력
	printf ("두번째 좌표의 y값? ");
	// y2 입력받기
	scanf("%f", &y2);

	// 거리 계산
	distance = sqrt(pow(x1 - x2, 2) + pow(y1 - y2, 2)); 
	
	//출력
	printf ("두 좌표 사이의 거리는 %.1f", distance);
 
	//---------------------------
 
	// 함수 종료
	return 0;
}