/*
1-9. 1차 함수의 계수 입력받아 f(x)값 구하기
1차 함수 f(x) = ax + b에 대해 계수 a, b를 입력 받은 후, x의 값을 입력받아

이 x값에 대한 f(x)의 값을 출력하라.

변수는 다음과 같이 사용하라.

int a, b; // 1차 함수의 계수 a, b
int x;    // x값
int a, b; // 1차 함수의 계수 a, b
int x;    // x값
실행 예)

	
	1차 함수의 계수 a와 b를 입력 1 4
	x값을 입력 1
	f(x)의 값은 5입니다.

	1차 함수의 계수 a와 b를 입력 3 4
	x값을 입력 2
	f(x)의 값은 10입니다.
*/


#include <stdio.h>

int main(void) {
	// 변수 선언
	int a, b; // 1차 함수의 계수 a, b
	int x;    // x값

	//---------------------------

	// "1차 함수의 계수 a와 b를 입력 " 출력
	printf ("1차 함수의 계수 a와 b를 입력 ");
	// a, b 입력 받기
	scanf ("%d %d", &a, &b);
	
	// "x값을 입력 " 출력
	printf("x값을 입력 ");
	// x 값 입력받기
	scanf ("%d", &x);
	
	// 결과 출력
	printf ("f(x)의 값은 %d입니다.", (a * x + b));

	//---------------------------
 
	// 함수 종료
	return 0; 

}